#######################################################
#                                                     
#  Innovus Command Logging File                     
#  Created on Wed Sep 10 22:47:25 2025                
#                                                     
#######################################################

#@(#)CDS: Innovus v20.10-p004_1 (64bit) 05/07/2020 20:02 (Linux 2.6.32-431.11.2.el6.x86_64)
#@(#)CDS: NanoRoute 20.10-p004_1 NR200413-0234/20_10-UB (database version 18.20.505) {superthreading v1.69}
#@(#)CDS: AAE 20.10-p005 (64bit) 05/07/2020 (Linux 2.6.32-431.11.2.el6.x86_64)
#@(#)CDS: CTE 20.10-p005_1 () Apr 14 2020 09:14:28 ( )
#@(#)CDS: SYNTECH 20.10-b004_1 () Mar 12 2020 22:18:21 ( )
#@(#)CDS: CPE v20.10-p006
#@(#)CDS: IQuantus/TQuantus 19.1.3-s155 (64bit) Sun Nov 3 18:26:52 PST 2019 (Linux 2.6.32-431.11.2.el6.x86_64)

set_global _enable_mmmc_by_default_flow      $CTE::mmmc_default
suppressMessage ENCEXT-2799
win
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/vantruong/final_pj/pd1/fn_prj_here/data/user_setting/all_lef_files.tcl  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/vantruong/final_pj/pd1/fn_prj_here/data/user_setting/all_lef_files.tcl  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/vantruong/final_pj/pd1/fn_prj_here/data/user_setting/all_lef_files.tcl  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/vantruong/final_pj/pd1/fn_prj_here/data/user_setting/all_lef_files.tcl  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/vantruong/final_pj/pd1/fn_prj_here/data/user_setting/all_lef_files.tcl  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/share/pd/data/user_setting/sg13g2_tech.lef  /ictc/student_data/share/pd/data/user_setting/sg13g2_stdcell_weltap.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_2048x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_4096x8_c3_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_4096x16_c3_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_64x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_1024x16_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_256x48_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_1024x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_1024x8_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_256x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_512x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/sg13g2_io_notracks.lef  /ictc/student_data/share/pd/data/user_setting/sg13g2_io.lef  /ictc/student_data/share/pd/data/user_setting/bondpad_70x70.lef  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
floorPlan -site CoreSite -d 1840.32 1840.02 168 168 168 168
saveDesign SAVED/00_init_design_init.invs
check_library -all_lib_cell -place > rpt/00_init_design/check_library.rpt
update_names -restricted . -replace_str _
update_names -restricted {[} -replace_str _
update_names -restricted \] -replace_str _
deleteRow -all
initCoreRow
cutRow
add_tracks -offset {Metal1 vert 0 Metal2 horiz 0 Metal3 vert 0 Metal4 horiz 0 Metal5 vert 0 TopMetal1 horiz 0 TopMetal2 vert 0}
checkFPlan -reportUtil > rpt/00_init_design/check_library.rpt
placeInstance {i_croc_soc/i_croc/gen_sram_bank[1].i_sram/gen_512x32xBx1.i_cut} -fixed {650.07 425.06}
win
freeDesign
setMultiCpuUsage -localCpu 2
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
set init_verilog /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/netlist/croc_chip_yosys.v
set init_design_uniquify 1
set init_design_settop 1
set init_top_cell croc_chip
set init_lef_file { /ictc/student_data/share/pd/data/user_setting/sg13g2_tech.lef  /ictc/student_data/share/pd/data/user_setting/sg13g2_stdcell_weltap.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_2048x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_4096x8_c3_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_4096x16_c3_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_64x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_1024x16_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_256x48_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_1024x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_1024x8_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_256x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/RM_IHPSG13_1P_512x64_c2_bm_bist.lef  /ictc/student_data/share/pd/data/user_setting/sg13g2_io_notracks.lef  /ictc/student_data/share/pd/data/user_setting/sg13g2_io.lef  /ictc/student_data/share/pd/data/user_setting/bondpad_70x70.lef  }
set init_mmmc_file /ictc/student_data/vantruong/final_pj/fn_prj_here/input_data/croc_mmmc.view
set init_pwr_net VDD
set init_gnd_net VSS
init_design
floorPlan -site CoreSite -d 1840.32 1840.02 168 168 168 168
saveDesign SAVED/00_init_design_init.invs
check_library -all_lib_cell -place > rpt/00_init_design/check_library.rpt
deleteRow -all
initCoreRow
cutRow
add_tracks -offset {Metal1 vert 0 Metal2 horiz 0 Metal3 vert 0 Metal4 horiz 0 Metal5 vert 0 TopMetal1 horiz 0 TopMetal2 vert 0}
checkFPlan -reportUtil > rpt/00_init_design/check_library.rpt
placeInstance {i_croc_soc/i_croc/gen_sram_bank[1].i_sram/gen_512x32xBx1.i_cut} -fixed {650.07 425.06}
placeInstance {i_croc_soc/i_croc/gen_sram_bank[0].i_sram/gen_512x32xBx1.i_cut} -fixed {650.07 560.84}
checkDesign -all > rpt/00_init_design/check_design.rpt
clearGlobalNets
globalNetConnect VDD -type pgpin -pin VDD -inst * -override
globalNetConnect VSS -type pgpin -pin VSS -inst * -override
setEndCapMode -prefix ENDCAP -leftEdge sky130_fd_sc_hd__endcap -rightEdge sky130_fd_sc_hd__endcap
addEndCap
verifyEndCap
editDelete -type Special -use POWER
globalNetConnect VDD -type pgpin -pin VDDARRAY -inst * -override
globalNetConnect VDD -type pgpin -pin VDDARRAY! -inst * -override
globalNetConnect VDD -type pgpin -pin VDD! -inst * -override
globalNetConnect VSS -type pgpin -pin VSS! -inst * -override
createRouteBlk -name sram_rblk -layer Metal5 -box {{640.07 415.06 1444.55 689.62}}
sroute -connect { blockPin corePin floatingStripe } -layerChangeRange { Metal1  TopMetal2 } -blockPinTarget { nearestRingStripe nearestTarget } -corePinTarget { firstAfterRowEnd } -floatingStripeTarget { blockring padring ring stripe ringpin blockpin followpin } -allowJogging 1 -crossoverViaLayerRange {  Metal1 TopMetal2 } -nets {VDD VSS} -allowLayerChange 1 -blockPin useLef -targetViaLayerRange { Metal1 TopMetal2 }
setAddStripeMode -reset
setAddStripeMode -stacked_via_top_layer Metal3 -stacked_via_bottom_layer Metal1 -stapling_nets_style side_to_side
addStripe -layer Metal3 -direction vertical -nets {VDD VSS} -width 1 -set_to_set_distance 15 -spacing 2 -start 0.5 -area {{348.0 348.0 1492.32 1492.02}}
setAddStripeMode -reset
setAddStripeMode -stacked_via_top_layer Metal4 -stacked_via_bottom_layer Metal3 -stapling_nets_style side_to_side
addStripe -layer Metal4 -direction horizontal -nets {VDD VSS} -width 1 -set_to_set_distance 30 -spacing 2 -start 15 -area {{348.0 348.0 1492.32 1492.02}}
setAddStripeMode -stacked_via_top_layer Metal5 -stacked_via_bottom_layer Metal4 -stapling_nets_style side_to_side
addStripe -layer Metal5 -direction vertical -nets {VDD VSS} -width 1 -set_to_set_distance 15 -spacing 2 -start 3 -area {{348.0 348.0 1492.32 1492.02}}
setAddStripeMode -stacked_via_top_layer TopMetal1 -stacked_via_bottom_layer Metal5 -stapling_nets_style side_to_side
addStripe -layer TopMetal1 -direction horizontal -nets {VDD VSS} -width 4 -set_to_set_distance 30 -spacing 4 -start 0.5 -area {{348.0 348.0 1492.32 1492.02}}
setAddStripeMode -stacked_via_top_layer TopMetal2 -stacked_via_bottom_layer TopMetal1 -stapling_nets_style side_to_side
addStripe -layer TopMetal2 -direction vertical -nets {VDD VSS} -width 4 -set_to_set_distance 30 -spacing 4 -area {{348.0 348.0 1492.32 1492.02}}
deleteRouteBlk -name sram_rblk
editPowerVia -nets VDD -add_vias true -top_layer TopMetal1 -area {640.07 415.06 1444.55 689.62} -uda -orthogonal_only
editPowerVia -nets VSS -add_vias true -top_layer TopMetal1 -area {640.07 415.06 1444.55 689.62} -uda -orthogonal_only
verifyPowerVia
verify_connectivity -net {VDD VSS}
saveDesign SAVED/00_init_design_PG.invs
addWellTap -cell sky130_fd_sc_hd__tapvpwrvgnd_1 -cellInterval 40 -inRowOffset 25 -prefix WELLTAP
saveDesign SAVED/00_init_design.invs
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
update_names -restricted . -replace_str _
update_names -restricted {[} -replace_str _
update_names -restricted \] -replace_str _
timeDesign -prePlace -pathReports -slackReports -numPaths 1000 -prefix 00_init_design_prePlace -outDir ./rpt/00_init_design_prePlace
win
setLayerPreference violation -isVisible 0
zoomBox 539.91800 477.94000 1398.39400 1326.93000
zoomBox 822.23500 728.59500 1203.14600 1105.29700
zoomBox 909.12500 805.74100 1143.05300 1037.08400
zoomBox 929.86800 824.15800 1128.70700 1020.80000
zoomBox 995.25700 882.21200 1083.48400 969.46400
zoomBox 1020.18700 904.34700 1066.24200 949.89300
zoomBox 1024.27100 907.97300 1063.41800 946.68700
zoomBox 1015.38200 900.08100 1069.56500 953.66500
zoomBox 1009.02500 895.76600 1072.77000 958.80700
setLayerPreference node_layer -isVisible 0
setLayerPreference node_layer -isVisible 1
setLayerPreference Metal3 -isVisible 0
zoomBox 1003.24400 892.45100 1078.23900 966.61700
zoomBox 996.44400 888.55100 1084.67300 975.80500
zoomBox 979.03200 878.56500 1101.14900 999.33300
zoomBox 954.93100 864.74400 1123.95200 1031.89700
zoomBox 900.36300 833.44900 1175.58700 1105.63200
zoomBox 811.50800 782.49300 1259.66500 1225.69800
zoomBox 770.87200 759.18900 1298.11600 1280.60700
zoomBox 723.06500 731.77300 1343.35200 1345.20600
update_names -restricted . -replace_str _
update_names -restricted {[} -replace_str _
update_names -restricted \] -replace_str _
setMultiCpuUsage -localCpu 8
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
setAnalysisMode -analysisType onchipvariation
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
current_design
set_max_fanout 32 [current_design]
current_design
set_max_transition 0.5 [current_design] 
setExtractRCMode -layerIndependent 1
setExtractRCMode -defViaCap true
setDesignMode -reset -congEffort
setDesignMode -flowEffort standard -process 130
setDesignMode -topRoutingLayer Metal5
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setPlaceMode -place_opt_post_place_tcl /ictc/student_data/vantruong/final_pj/fn_prj_here/data/scripts/common/place_opt_post_place.tcl
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
reset_path_group -all
group_path -name reg2reg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2icg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name reg2mem -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers -macros] "is_memory_cell == true"]
group_path -name mem2reg -from [filter_collection [all_registers -macros] "is_memory_cell == true"] -to  [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2out -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [all_outputs]
group_path -name in2reg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name in2icg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name in2out  -from [all_inputs -no_clocks] -to [all_outputs]
setPathGroupOptions reg2reg -effortLevel high
setPathGroupOptions reg2icg -effortLevel high
setPathGroupOptions reg2mem -effortLevel high
setPathGroupOptions mem2reg -effortLevel high
setPathGroupOptions reg2out -effortLevel low
setPathGroupOptions in2reg -effortLevel low
setPathGroupOptions in2icg -effortLevel low
setPathGroupOptions in2out -effortLevel low
reportPathGroupOptions
setOptMode -addInstancePrefix ictc_preCTS_
set_dont_use sg13g2_buf_16 false
set_dont_use sg13g2_inv_16 false
place_opt_design
selectInst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_615_0
zoomBox -705.63700 -18.58100 1972.43700 2629.90100
optDesign -preCTS
win
zoomBox -319.33000 -404.61800 2088.47900 1976.58500
zoomBox -574.43100 -763.79500 2258.28600 2037.62100
zoomBox -1643.02200 -2255.23200 2969.58600 2306.40800
zoomBox -3383.04400 -4626.57500 4127.82000 2801.29600
zoomBox -5422.25700 -10047.58800 8966.20000 4181.88100
zoomBox -7110.34100 -12133.14300 9817.25600 4607.40900
zoomBox -9096.32200 -14586.73700 10818.49800 5108.03000
zoomBox -4485.75300 -7364.09700 5909.90800 2916.69500
zoomBox -2446.79600 -4320.43600 3937.43900 1993.25500
zoomBox -478.09300 -1573.40700 2354.62700 1228.01200
zoomBox 272.47900 -503.65400 1751.17600 958.70400
zoomBox 395.43100 -328.41700 1652.32400 914.58800
zoomBox 664.28100 54.76200 1436.17100 818.12300
zoomBox 263.36600 -520.57800 1742.06500 941.78200
setLayerPreference node_net -isVisible 0
zoomBox -1176.52800 -1641.65400 2744.18800 2235.73900
zoomBox -2039.01300 -2886.85000 3387.58500 2479.78600
zoomBox -2605.13000 -3638.14400 3779.10400 2675.54600
zoomBox -4976.52600 -6785.23000 5419.13400 3495.56100
zoomBox -6061.02600 -8224.47300 6169.16200 3870.57500
zoomBox -12681.43700 -16989.81400 10747.76300 6180.50000
zoomBox -21655.21800 -28051.15200 16495.32200 9677.83500
zoomBox -36223.37700 -46062.69400 25898.40600 15372.66000
zoomBox -42885.77200 -54299.83700 30198.67900 17977.05100
zoomBox -51032.65800 -63824.33000 34949.04900 21207.30300
zoomBox -60617.22900 -75029.61600 40537.72000 25007.59900
zoomBox -35960.92100 -46204.01800 26160.86300 15231.33700
zoomBox -17204.05000 -24275.43100 15223.91100 7794.21000
zoomBox -10060.26900 -14850.24900 9854.55300 4844.52000
zoomBox -6905.25600 -10687.66600 7483.20400 3541.80500
zoomBox -3830.40000 -6480.66200 5005.91400 2258.01300
zoomBox -3112.75500 -5460.33600 4398.11200 1967.53800
zoomBox -2502.75600 -4566.08600 3881.48100 1747.60700
zoomBox -1978.96600 -3747.77500 3447.63500 1618.86400
zoomBox -366.72200 -1379.44400 2041.09100 1001.76300
zoomBox 199.20000 -451.08000 1456.09400 791.92600
zoomBox 268.29400 -303.51600 1336.65400 753.03900
zoomBox -30.41400 -833.38800 1709.23300 887.03600
zoomBox -172.88800 -1075.36800 1873.75600 948.66100
zoomBox -1132.78300 -2542.19500 2787.94700 1335.21200
zoomBox -1573.65800 -3070.99000 3038.96500 1490.66500
zoomBox -396.89600 -1749.99900 2435.83200 1051.42800
zoomBox 325.78400 -938.74600 2065.43400 781.68100
zoomBox 875.55000 -321.59900 1783.65900 576.47600
zoomBox 630.70800 -774.50300 2109.41300 687.86300
zoomBox 725.88400 -598.44800 1982.78400 644.56400
zoomBox 400.09200 -1231.12300 2446.74500 792.91500
zoomBox -87.77600 -2296.85200 3244.85800 998.95700
optDesign -preCTS -incr
optDesign -preCTS -incr
timeDesign -hold -preCTS -slackReports
optDesign -preCTS -incr
saveDesign 02timingclean
setMultiCpuUsage -localCpu 8
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
setAnalysisMode -analysisType onchipvariation
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
current_design
set_max_fanout 32 [current_design]
current_design
set_max_transition 0.5 [current_design] 
setExtractRCMode -layerIndependent 1
setExtractRCMode -defViaCap true
setDesignMode -reset -congEffort
setDesignMode -flowEffort standard -process 130
setDesignMode -topRoutingLayer Metal5
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setPlaceMode -place_opt_post_place_tcl /ictc/student_data/vantruong/final_pj/fn_prj_here/data/scripts/common/place_opt_post_place.tcl
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
reset_path_group -all
group_path -name reg2reg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2icg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name reg2mem -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers -macros] "is_memory_cell == true"]
group_path -name mem2reg -from [filter_collection [all_registers -macros] "is_memory_cell == true"] -to  [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2out -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [all_outputs]
group_path -name in2reg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name in2icg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name in2out  -from [all_inputs -no_clocks] -to [all_outputs]
setPathGroupOptions reg2reg -effortLevel high
setPathGroupOptions reg2icg -effortLevel high
setPathGroupOptions reg2mem -effortLevel high
setPathGroupOptions mem2reg -effortLevel high
setPathGroupOptions reg2out -effortLevel low
setPathGroupOptions in2reg -effortLevel low
setPathGroupOptions in2icg -effortLevel low
setPathGroupOptions in2out -effortLevel low
reportPathGroupOptions
set_ccopt_property -integration native
set_ccopt_property -buffer_cells {sg13g2_buf_16 sg13g2_buf_8 sg13g2_buf_4 sg13g2_buf_2}
add_ndr -name ndr_1w2s -spacing_multiplier {Metal2:Metal5 2} -width_multiplier {Metal2:Metal5 2}
modify_ndr -name ndr_1w2s -generate_via
add_ndr -name ndr_3w3s -spacing_multiplier {Metal2:Metal5 3} -width_multiplier {Metal2:Metal5 3}
modify_ndr -name ndr_3w3s -generate_via
add_ndr -name ndr_2w2s -spacing_multiplier {Metal2:Metal5 2} -width_multiplier {Metal2:Metal5 2}
modify_ndr -name ndr_2w2s -generate_via
create_route_type -name clk_trunk -top_preferred_layer Metal5 -bottom_preferred_layer Metal3 -non_default_rule ndr_3w3s
create_route_type -name clk_leaf -top_preferred_layer Metal4 -bottom_preferred_layer Metal1 -non_default_rule ndr_2w2s
set_ccopt_property -route_type clk_trunk -net_type trunk
set_ccopt_property -route_type clk_leaf -net_type leaf
set_ccopt_property -max_fanout 32
set_ccopt_property -target_max_trans 1.6
set_ccopt_property -target_skew 0.2
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
set_dont_use sg13g2_buf_16 false
set_dont_use sg13g2_inv_16 false
set_dont_use $dont_use_cells
set_dont_use sg13g2_buf_16 false
set_dont_use sg13g2_inv_16 false
create_ccopt_clock_tree_spec -file ccopt_native.spec
get_ccopt_clock_trees
ccopt_check_and_flatten_ilms_no_restore
set_ccopt_property sink_type -pin i_croc_soc/i_croc/i_dmi_jtag/i_dmi_jtag_tap_i_dft_tck_mux/i_mux/A1 ignore
set_ccopt_property sink_type_reasons -pin i_croc_soc/i_croc/i_dmi_jtag/i_dmi_jtag_tap_i_dft_tck_mux/i_mux/A1 set_case_analysis
set_ccopt_property sink_type -pin pad_ref_clk_i/pad ignore
set_ccopt_property sink_type_reasons -pin pad_ref_clk_i/pad no_sdc_clock
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_cs_registers_i/debug_ebreakm_o_reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_0__reg/CLK 0.216
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_12__reg/CLK 0.206
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_13__reg/CLK 0.234
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_14__reg/CLK 0.205
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_15__reg/CLK 0.279
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_16__reg/CLK 0.267
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_17__reg/CLK 0.246
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_18__reg/CLK 0.104
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_19__reg/CLK 0.198
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_1__reg/CLK 0.235
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_20__reg/CLK 0.293
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_21__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_22__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_23__reg/CLK 0.201
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_24__reg/CLK 0.289
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_25__reg/CLK 0.190
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_26__reg/CLK 0.217
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_27__reg/CLK 0.281
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_28__reg/CLK 0.275
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_29__reg/CLK 0.276
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_2__reg/CLK 0.199
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_30__reg/CLK 0.256
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_31__reg/CLK 0.204
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_3__reg/CLK 0.187
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_4__reg/CLK 0.230
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_5__reg/CLK 0.193
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_i_6__reg/CLK 0.213
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_controller_i_instr_valid_i_reg/CLK 0.281
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_id_stage_i_id_fsm_q_reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_load_store_unit_i_ls_fsm_cs_0__reg/CLK 0.287
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_load_store_unit_i_ls_fsm_cs_1__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_core_wrap/i_ibex_load_store_unit_i_ls_fsm_cs_2__reg/CLK 0.287
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_dmi_jtag/i_dmi_cdc_i_cdc_req/i_dst/async_ack_o_reg/CLK 0.313
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_dmi_jtag/td_o_reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_106__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_113__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_120__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_127__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_134__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_141__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_148__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_155__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_15__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_162__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_169__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_176__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_183__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_190__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_197__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_1__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_204__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_211__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_218__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_22__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_29__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_36__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_43__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_50__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_57__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_64__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_71__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_78__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_85__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_8__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_92__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg2hw_99__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_timer/counter_lo_i_target_reached_o_reg/CLK 0.034
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_timer/s_cfg_hi_reg_2__reg/CLK 0.352
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_timer/s_cfg_lo_reg_2__reg/CLK 0.368
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_timer/s_cfg_lo_reg_31__reg/CLK 0.300
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_uart/i_apb_uart_UART_IIC_IIR_0__reg/CLK 0.300
set_ccopt_property cts_is_sdc_clock_root -pin clk_i true
set_ccopt_property cts_is_sdc_clock_root -pin jtag_tck_i true
set_ccopt_property cts_is_sdc_clock_root -pin ref_clk_i true
create_ccopt_clock_tree -name clk_sys -source clk_i -no_skew_group
set_ccopt_property target_max_trans_sdc -delay_corner delay_wc -early -clock_tree clk_sys 0.200
set_ccopt_property target_max_trans_sdc -delay_corner delay_wc -late -clock_tree clk_sys 0.200
set_ccopt_property source_driver -clock_tree clk_sys {sg13g2_IOPadOut16mA/c2p sg13g2_IOPadOut16mA/pad}
set_ccopt_property clock_period -pin clk_i 10
create_ccopt_clock_tree -name clk_rtc -source ref_clk_i -no_skew_group
set_ccopt_property target_max_trans_sdc -delay_corner delay_wc -early -clock_tree clk_rtc 0.200
set_ccopt_property target_max_trans_sdc -delay_corner delay_wc -late -clock_tree clk_rtc 0.200
set_ccopt_property source_driver -clock_tree clk_rtc {sg13g2_IOPadOut16mA/c2p sg13g2_IOPadOut16mA/pad}
set_ccopt_property clock_period -pin ref_clk_i 50
create_ccopt_clock_tree -name clk_jtg -source jtag_tck_i -no_skew_group
set_ccopt_property target_max_trans_sdc -delay_corner delay_wc -early -clock_tree clk_jtg 0.200
set_ccopt_property target_max_trans_sdc -delay_corner delay_wc -late -clock_tree clk_jtg 0.200
set_ccopt_property source_driver -clock_tree clk_jtg {sg13g2_IOPadOut16mA/c2p sg13g2_IOPadOut16mA/pad}
set_ccopt_property clock_period -pin jtag_tck_i 20
create_ccopt_skew_group -name clk_jtg/func_mode_ideal_wc -sources jtag_tck_i -auto_sinks
set_ccopt_property include_source_latency -skew_group clk_jtg/func_mode_ideal_wc true
set_ccopt_property extracted_from_clock_name -skew_group clk_jtg/func_mode_ideal_wc clk_jtg
set_ccopt_property extracted_from_constraint_mode_name -skew_group clk_jtg/func_mode_ideal_wc func_mode_ideal_wc
set_ccopt_property extracted_from_delay_corners -skew_group clk_jtg/func_mode_ideal_wc delay_wc
create_ccopt_skew_group -name clk_rtc/func_mode_ideal_wc -sources ref_clk_i -auto_sinks
set_ccopt_property include_source_latency -skew_group clk_rtc/func_mode_ideal_wc true
set_ccopt_property extracted_from_clock_name -skew_group clk_rtc/func_mode_ideal_wc clk_rtc
set_ccopt_property extracted_from_constraint_mode_name -skew_group clk_rtc/func_mode_ideal_wc func_mode_ideal_wc
set_ccopt_property extracted_from_delay_corners -skew_group clk_rtc/func_mode_ideal_wc delay_wc
create_ccopt_skew_group -name clk_sys/func_mode_ideal_wc -sources clk_i -auto_sinks
set_ccopt_property include_source_latency -skew_group clk_sys/func_mode_ideal_wc true
set_ccopt_property extracted_from_clock_name -skew_group clk_sys/func_mode_ideal_wc clk_sys
set_ccopt_property extracted_from_constraint_mode_name -skew_group clk_sys/func_mode_ideal_wc func_mode_ideal_wc
set_ccopt_property extracted_from_delay_corners -skew_group clk_sys/func_mode_ideal_wc delay_wc
create_ccopt_skew_group -name clk_jtg/func_mode_ideal_bc -sources jtag_tck_i -auto_sinks
set_ccopt_property include_source_latency -skew_group clk_jtg/func_mode_ideal_bc true
set_ccopt_property extracted_from_clock_name -skew_group clk_jtg/func_mode_ideal_bc clk_jtg
set_ccopt_property extracted_from_constraint_mode_name -skew_group clk_jtg/func_mode_ideal_bc func_mode_ideal_bc
set_ccopt_property extracted_from_delay_corners -skew_group clk_jtg/func_mode_ideal_bc delay_bc
create_ccopt_skew_group -name clk_rtc/func_mode_ideal_bc -sources ref_clk_i -auto_sinks
set_ccopt_property include_source_latency -skew_group clk_rtc/func_mode_ideal_bc true
set_ccopt_property extracted_from_clock_name -skew_group clk_rtc/func_mode_ideal_bc clk_rtc
set_ccopt_property extracted_from_constraint_mode_name -skew_group clk_rtc/func_mode_ideal_bc func_mode_ideal_bc
set_ccopt_property extracted_from_delay_corners -skew_group clk_rtc/func_mode_ideal_bc delay_bc
create_ccopt_skew_group -name clk_sys/func_mode_ideal_bc -sources clk_i -auto_sinks
set_ccopt_property include_source_latency -skew_group clk_sys/func_mode_ideal_bc true
set_ccopt_property extracted_from_clock_name -skew_group clk_sys/func_mode_ideal_bc clk_sys
set_ccopt_property extracted_from_constraint_mode_name -skew_group clk_sys/func_mode_ideal_bc func_mode_ideal_bc
set_ccopt_property extracted_from_delay_corners -skew_group clk_sys/func_mode_ideal_bc delay_bc
check_ccopt_clock_tree_convergence
get_ccopt_property auto_design_state_for_ilms
set_ccopt_property target_max_trans 0.8
set_ccopt_property -max_fanout 32
set_ccopt_property -target_skew 0.15
set_ccopt_property override_minimum_skew_target true
set_ccopt_property insertion_delay -pin i_croc_soc/i_croc/i_gpio/i_reg_file_reg_q_188__reg/CLK 0.150
set_ccopt_property sink_type -pin i_croc_soc/i_croc/i_gpio/i_reg_file_new_reg_251__reg/CLK ignore
ccopt_design -cts
saveDesign SAVED/03_CTS_fn.invs
report_ccopt_skew_groups -file ./rpt/03_CTS_fn/ccopt_skew_groups.rpt
report_ccopt_clock_trees -file ./rpt/03_CTS_fn/ccopt_clock_trees.rpt
checkFPlan -reportUtil > rpt/03_CTS_fn/check_util.rpt
checkDesign -all > rpt/03_CTS_fn/check_design.rpt
checkPlace > rpt/03_CTS_fn/checkPlace.rpt
reportCongestion -overflow -includeBlockage -hotSpot > rpt/03_CTS_fn/reportCongestion.rpt
timeDesign -postCTS -pathReports -slackReports -numPaths 1000 -prefix croc_postCTS -outDir ./rpt/03_CTS_fn/03_CTS_fn_setup
timeDesign -postCTS -hold -pathReports -slackReports -numPaths 1000 -prefix croc_postCTS -outDir ./rpt/03_CTS_fn/03_CTS_fn_hold
setMultiCpuUsage -localCpu 8
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
setAnalysisMode -analysisType onchipvariation
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
current_design
set_max_fanout 32 [current_design]
current_design
set_max_transition 0.5 [current_design] 
setExtractRCMode -layerIndependent 1
setExtractRCMode -defViaCap true
setDesignMode -reset -congEffort
setDesignMode -flowEffort standard -process 130
setDesignMode -topRoutingLayer Metal5
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setPlaceMode -place_opt_post_place_tcl /ictc/student_data/vantruong/final_pj/fn_prj_here/data/scripts/common/place_opt_post_place.tcl
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
reset_path_group -all
group_path -name reg2reg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2icg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name reg2mem -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers -macros] "is_memory_cell == true"]
group_path -name mem2reg -from [filter_collection [all_registers -macros] "is_memory_cell == true"] -to  [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2out -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [all_outputs]
group_path -name in2reg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name in2icg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name in2out  -from [all_inputs -no_clocks] -to [all_outputs]
setPathGroupOptions reg2reg -effortLevel high
setPathGroupOptions reg2icg -effortLevel high
setPathGroupOptions reg2mem -effortLevel high
setPathGroupOptions mem2reg -effortLevel high
setPathGroupOptions reg2out -effortLevel low
setPathGroupOptions in2reg -effortLevel low
setPathGroupOptions in2icg -effortLevel low
setPathGroupOptions in2out -effortLevel low
reportPathGroupOptions
set_ccopt_property -update_io_latency true
set_dont_use $dont_use_cells
set_dont_use sg13g2_buf_16 false
set_dont_use sg13g2_inv_16 false
setAnalysisMode -cppr both -clockGatingCheck 1 -timeBorrowing 1 -useOutputPinCap 1 -sequentialConstProp 1 -timingSelfLoopsNoSkew 0 -enableMultipleDriveNet 1 -clkSrcPath 1 -warn 1 -usefulSkew 1 -analysisType onChipVariation -skew true -clockPropagation sdcControl -log 1
all_setup_analysis_views 
all_hold_analysis_views 
set_analysis_view -setup [all_setup_analysis_views ] -hold [all_hold_analysis_views ]
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
redirect -quiet {set honorDomain [getAnalysisMode -honorClockDomains]} > /dev/null
reportPathGroupOptions
setOptMode -fixCap true -fixTran true -fixFanoutLoad true
setOptMode -addInstancePrefix ictc_postCTS_setup
optDesign -postCTS -expandedViews -timingDebugReport -outDir ./rpt/04_CTS_opt_fn_setup
saveDesign SAVED/04_CTS_opt_fn_setup.invs
timeDesign -postCTS -hold -pathReports -slackReports -numPaths 1000 -prefix croc_postCTS -outDir ./rpt/04_CTS_opt_fn/04_CTS_opt_fn_hold
setOptMode -addInstancePrefix ictc_postCTS_hold
optDesign -postCTS -hold -expandedViews -timingDebugReport -outDir ./rpt/04_CTS_opt_fn_hold
saveDesign SAVED/04_CTS_opt_fn_hold.invs
timeDesign -postCTS -pathReports -slackReports -numPaths 1000 -prefix croc_postCTS -outDir ./rpt/04_CTS_opt_fn/04_CTS_opt_fn_Opt_setup
timeDesign -postCTS -hold -pathReports -slackReports -numPaths 1000 -prefix croc_postCTS -outDir ./rpt/04_CTS_opt_fn/04_CTS_opt_fn_Opt_hold
saveDesign SAVED/04_CTS_opt_fn.invs
checkFPlan -reportUtil > rpt/04_CTS_opt_fn/check_util.rpt
checkDesign -all > rpt/04_CTS_opt_fn/check_design.rpt
checkPlace > rpt/04_CTS_opt_fn/checkPlace.rpt
reportCongestion -overflow -includeBlockage -hotSpot > rpt/04_CTS_opt_fn/reportCongestion.rpt
timeDesign -hold -preCTS -slackReports
timeDesign -hold -postCTS -slackReports
timeDesign -postCTS -slackReports
optDesign -postcTS
optDesign -postcTS -incr
optDesign -postcTS -SETUP
optDesign -postcTS -setup
timeDesign -hold -postCTS -slackReports
optDesign -postcTS -hold
timeDesign -postCTS -slackReports
timeDesign -hold -postCTS -slackReports
saveDesign 04timingclean
setMultiCpuUsage -localCpu 8
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
setAnalysisMode -analysisType onchipvariation
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
current_design
set_max_fanout 32 [current_design]
current_design
set_max_transition 0.5 [current_design] 
setExtractRCMode -layerIndependent 1
setExtractRCMode -defViaCap true
setDesignMode -reset -congEffort
setDesignMode -flowEffort standard -process 130
setDesignMode -topRoutingLayer Metal5
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setPlaceMode -place_opt_post_place_tcl /ictc/student_data/vantruong/final_pj/fn_prj_here/data/scripts/common/place_opt_post_place.tcl
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
reset_path_group -all
group_path -name reg2reg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2icg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name reg2mem -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers -macros] "is_memory_cell == true"]
group_path -name mem2reg -from [filter_collection [all_registers -macros] "is_memory_cell == true"] -to  [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2out -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [all_outputs]
group_path -name in2reg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name in2icg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name in2out  -from [all_inputs -no_clocks] -to [all_outputs]
setPathGroupOptions reg2reg -effortLevel high
setPathGroupOptions reg2icg -effortLevel high
setPathGroupOptions reg2mem -effortLevel high
setPathGroupOptions mem2reg -effortLevel high
setPathGroupOptions reg2out -effortLevel low
setPathGroupOptions in2reg -effortLevel low
setPathGroupOptions in2icg -effortLevel low
setPathGroupOptions in2out -effortLevel low
reportPathGroupOptions
setNanoRouteMode -reset
set_dont_use sg13g2_buf_16 false
set_dont_use sg13g2_inv_16 false
setDesignMode -topRoutingLayer Metal5
setNanoRouteMode -dbProcessNode 130
setNanoRouteMode -quiet -routeInsertAntennaDiode 1
setNanoRouteMode -quiet -routeAntennaCellName sky130_fd_sc_hd__diode_2
setNanoRouteMode -quiet -timingEngine {}
setNanoRouteMode -quiet -routeWithTimingDriven 1
setNanoRouteMode -quiet -routeWithSiDriven 1
setNanoRouteMode -quiet -routeWithSiPostRouteFix 0
setNanoRouteMode -quiet -drouteStartIteration default
setNanoRouteMode -quiet -routeBottomRoutingLayer default
setNanoRouteMode -quiet -drouteEndIteration default
setNanoRouteMode -quiet -routeWithTimingDriven true
setNanoRouteMode -quiet -routeWithSiDriven true
setNanoRouteMode -routeExpAdvancedPinAccess 2
setNanoRouteMode -drouteUseMultiCutViaEffort default
routeDesign -globalDetail
saveDesign SAVED/05_route.invs
timeDesign -postRoute -pathReports -slackReports -numPaths 1000 -prefix croc_postRoute -outDir ./rpt/05_route/05_route_setup
timeDesign -postRoute -hold -pathReports -slackReports -numPaths 1000 -prefix croc_postRoute -outDir ./rpt/05_route/05_route_hold
checkPlace > rpt/05_route/checkPlace.rpt
timeDesign -hold -postRoute -slackReports
timeDesign -postRoute -slackReports
optDesign -postRoute
optDesign -postRoute -incr
optDesign -postRoute -setup
timeDesign -hold -postRoute -slackReports
optDesign -postRoute -hold
timeDesign -postRoute -slackReports
verify_drc -limit 0
verify_connectivity -type regular
saveDesign 05timing_drc_clean
win
zoomBox -626.06600 -2800.48400 3294.68000 1076.93900
zoomBox -1233.86400 -3392.99200 3378.77800 1168.68200
setLayerPreference node_net -isVisible 1
zoomBox -255.30000 -1468.34800 2152.52900 912.87500
zoomBox 410.32000 -159.20300 1318.43200 738.87500
zoomBox 662.26000 334.42800 1004.75500 673.13900
zoomBox 763.82100 517.29500 892.99500 645.04200
zoomBox 801.90200 578.66700 859.21900 635.35100
zoomBox 751.34700 497.08200 903.32300 647.37900
zoomBox 678.45200 376.37000 969.59400 664.29500
zoomBox 496.07200 58.40500 1152.23400 707.31700
zoomBox 103.67600 -658.20700 1582.50300 804.27900
zoomBox -760.19600 -2273.27100 2572.71100 1022.80800
zoomBox -251.57000 -841.52800 1488.22800 879.04600
zoomBox 124.51400 28.28000 896.47300 791.70900
zoomBox 291.38400 414.21800 633.90800 752.95700
zoomBox 370.87800 584.75900 522.85800 735.06000
zoomBox 417.18200 647.50400 496.51700 725.96200
zoomBox 430.35900 666.39700 487.67800 723.08300
zoomBox 439.87900 680.04800 481.29200 721.00300
zoomBox 417.94900 647.64200 497.28500 726.10100
zoomBox 342.36700 535.68100 552.72500 743.71500
zoomBox 190.34200 310.31400 664.43700 779.17000
zoomBox -152.28500 -197.60600 916.20800 859.08000
zoomBox -546.42400 -770.41100 1193.43800 950.22600
zoomBox -840.36500 -1698.53500 1992.71100 1103.23600
zoomBox -2722.72000 -3891.43100 2704.56500 1475.88400
zoomBox -4200.70000 -5841.59700 3311.11300 1587.21300
zoomBox -3381.04200 -4804.05400 3004.00000 1510.43500
zoomBox -2684.33200 -3922.14300 2742.95400 1445.17300
zoomBox -880.42400 -1562.03500 1952.65400 1239.73800
setMultiCpuUsage -localCpu 8
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
setAnalysisMode -analysisType onchipvariation
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
current_design
set_max_fanout 32 [current_design]
current_design
set_max_transition 0.5 [current_design] 
setExtractRCMode -layerIndependent 1
setExtractRCMode -defViaCap true
setDesignMode -reset -congEffort
setDesignMode -flowEffort standard -process 130
setDesignMode -topRoutingLayer Metal5
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setPlaceMode -place_opt_post_place_tcl /ictc/student_data/vantruong/final_pj/fn_prj_here/data/scripts/common/place_opt_post_place.tcl
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
reset_path_group -all
group_path -name reg2reg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2icg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name reg2mem -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers -macros] "is_memory_cell == true"]
group_path -name mem2reg -from [filter_collection [all_registers -macros] "is_memory_cell == true"] -to  [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2out -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [all_outputs]
group_path -name in2reg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name in2icg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name in2out  -from [all_inputs -no_clocks] -to [all_outputs]
setPathGroupOptions reg2reg -effortLevel high
setPathGroupOptions reg2icg -effortLevel high
setPathGroupOptions reg2mem -effortLevel high
setPathGroupOptions mem2reg -effortLevel high
setPathGroupOptions reg2out -effortLevel low
setPathGroupOptions in2reg -effortLevel low
setPathGroupOptions in2icg -effortLevel low
setPathGroupOptions in2out -effortLevel low
reportPathGroupOptions
setNanoRouteMode -reset
setDesignMode -topRoutingLayer Metal5
setNanoRouteMode -dbProcessNode 130
setNanoRouteMode -quiet -routeInsertAntennaDiode 1
setNanoRouteMode -quiet -routeAntennaCellName sky130_fd_sc_hd__diode_2
setNanoRouteMode -quiet -timingEngine {}
setNanoRouteMode -quiet -routeWithTimingDriven 1
setNanoRouteMode -quiet -routeWithSiDriven 1
setNanoRouteMode -quiet -routeWithSiPostRouteFix 0
setNanoRouteMode -quiet -drouteStartIteration default
setNanoRouteMode -quiet -routeBottomRoutingLayer default
setNanoRouteMode -quiet -drouteEndIteration default
setNanoRouteMode -quiet -routeWithTimingDriven true
setNanoRouteMode -quiet -routeWithSiDriven true
setNanoRouteMode -routeExpAdvancedPinAccess 2
setNanoRouteMode -drouteUseMultiCutViaEffort default
setOptMode -addInstancePrefix ictc_postRoute_setup_
optDesign -postRoute
saveDesign SAVED/06_route_opt_setup.invs
timeDesign -postRoute -pathReports -slackReports -numPaths 1000 -prefix croc_postRoute -outDir ./rpt/06_route_opt/06_route_opt_setup
timeDesign -postRoute -hold -pathReports -slackReports -numPaths 1000 -prefix croc_postRoute -outDir ./rpt/06_route_opt/06_route_opt_hold
saveDesign SAVED/06_route_opt.invs
checkFPlan -reportUtil > rpt/06_route_opt/check_util.rpt
checkPlace > rpt/06_route_opt/checkPlace.rpt
verify_drc -limit 0 > rpt/06_route_opt/verify_drc.rpt
setFillerMode -core {sg13g2_fill_1 sg13g2_fill_2 sg13g2_fill_4 sg13g2_fill_8} -corePrefix FILLER
addFiller -doDrc false
checkFiller
saveDesign SAVED/06_route_opt_filler.invs
defOut -unit 1000 -usedVia -routing output/06_route_opt/croc_chip.def.gz
saveNetlist output/06_route_opt/croc_chip.v
write_lef_abstract -extractBlockObs -cutObsMinSpacing -specifyTopLayer TopMetal2 -5.8 -extractBlockPGPinLayers {TopMetal1 TopMetal2} output/06_route_opt/croc_chip.lef
win
setLayerPreference node_net -isVisible 0
zoomBox -5.06200 -412.34300 1473.82300 1050.20100
zoomBox 590.35800 369.67900 1148.12100 921.27900
zoomBox 762.69300 596.02500 1053.85000 883.96500
zoomBox 511.93900 288.80100 1168.13400 937.74500
zoomBox -443.38300 -881.66100 1603.53500 1142.63900
zoomBox -2210.97700 -3041.52800 2402.26000 1520.73400
zoomBox -476.95000 -1214.09900 1931.18900 1167.43100
zoomBox 702.53600 28.91900 1610.76600 927.11300
zoomBox 1153.62900 494.59800 1496.16900 833.35300
zoomBox 1259.03000 603.40600 1469.39300 811.44500
verify_connectivity -type regular
verify_drc -limit 0
timeDesign -postRoute -slackReports
timeDesign -hold -postRoute -slackReports
saveDesign 06complete
