#######################################################
#                                                     
#  Innovus Command Logging File                     
#  Created on Thu Aug 28 22:36:45 2025                
#                                                     
#######################################################

#@(#)CDS: Innovus v20.10-p004_1 (64bit) 05/07/2020 20:02 (Linux 2.6.32-431.11.2.el6.x86_64)
#@(#)CDS: NanoRoute 20.10-p004_1 NR200413-0234/20_10-UB (database version 18.20.505) {superthreading v1.69}
#@(#)CDS: AAE 20.10-p005 (64bit) 05/07/2020 (Linux 2.6.32-431.11.2.el6.x86_64)
#@(#)CDS: CTE 20.10-p005_1 () Apr 14 2020 09:14:28 ( )
#@(#)CDS: SYNTECH 20.10-b004_1 () Mar 12 2020 22:18:21 ( )
#@(#)CDS: CPE v20.10-p006
#@(#)CDS: IQuantus/TQuantus 19.1.3-s155 (64bit) Sun Nov 3 18:26:52 PST 2019 (Linux 2.6.32-431.11.2.el6.x86_64)

set_global _enable_mmmc_by_default_flow      $CTE::mmmc_default
suppressMessage ENCEXT-2799
win
is_common_ui_mode
restoreDesign /ictc/student_data/vantruong/final_pj/fn_prj_here/flowspd/savestage/otp_place.dat croc_chip
set_dont_use sg13g2_inv_16 false
timeDesign -preCTS
set_dont_use sg13g2_buf_16 false
report_timing -path_group reg2reg
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
report_timing -path_group reg2reg
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/_5005_/Y -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/_5005_/Y
report_timing -path_group reg2reg
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/_5721_ -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -through i_croc_soc/i_croc/i_core_wrap/_5721_
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/_5721_ -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -through i_croc_soc/i_croc/i_core_wrap/_5721_
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_8871_0_dup/X -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_8871_0_dup/X
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_8871_0_dup/X
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9371_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC6571_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC7872_FE_OFN662_i_ibex_id_stage_i_controller_i_instr_i_21 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9094_i_ibex_ex_block_i_multdiv_operand_b_i_2 -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC1_FE_RN_90
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC1_FE_RN_90
ecoDeleteRepeater -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC1_FE_RN_90
report_timing -path_group reg2reg
timeDesign -preCTS
report_timing -path_group reg2reg
report_timing -path_group reg2reg -gui
win
setLayerPreference violation -isVisible 0
setLayerPreference node_layer -isVisible 0
report_timing -path_group reg2reg -gui
win
fit
zoomBox -1199.67800 71.77700 3102.94700 1792.19600
zoomBox -820.87100 211.93600 2836.36100 1674.29200
zoomBox 64.38500 516.34000 2310.38400 1414.41000
zoomBox 436.85300 652.60800 2059.58800 1301.46400
zoomBox 557.21800 679.21700 1936.54400 1230.74500
zoomBox 820.41200 737.40100 1667.49100 1076.10800
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -cell sg13g2_inv_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0 -cell sg13g2_buf_4
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -cell sg13g2_buf_4
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_ECOC2_FE_RN_2680_0 -cell sg13g2_buf_1
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y
ecoDeleteRepeater -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_ECOC2_FE_RN_2680_0
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -cell sg13g2_inv_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -cell sg13g2_inv_4
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -cell sg13g2_inv_2
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0 -cell sg13g2_buf_2
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -cell sg13g2_buf_2
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y
ecoDeleteRepeater -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC3_FE_RN_37_0
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/_5721_ -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/_5721_ -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -cell sg13g2_buf_2
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC4_1715 -cell sg13g2_buf_4
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC4_1715 -cell sg13g2_buf_1
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC4_1715 -cell sg13g2_buf_2
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC4_1715 -cell sg13g2_buf_1
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -cell sg13g2_buf_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -cell sg13g2_buf_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -cell sg13g2_buf_4
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0 -cell sg13g2_inv_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0 -cell sg13g2_inv_8
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0 -cell sg13g2_inv_4
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC6315_3648 -cell sg13g2_inv_16
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC6315_3648
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/_8729_/X -cell sg13g2_buf_1
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC6315_3648 -through i_croc_soc/i_croc/i_core_wrap/_8729_/X
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC5_0240 -cell sg13g2_buf_4
report_timing -path_group reg2reg -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9061_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC4876_FE_OFN648_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_OCPC8999_FE_OFN647_i_ibex_id_stage_i_controller_i_instr_i_20 -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_preCTS_FE_RC_5008_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9115_FE_RN_50_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_5828_0/Y -through i_croc_soc/i_croc/i_core_wrap/_5721_ -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_4918_0/Y -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC9055_FE_OFN2143_core_data_obi_req_65 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_RC_11824_0 -through i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_OCPC6315_3648 -through i_croc_soc/i_croc/i_core_wrap/_8729_/X
ecoDeleteRepeater -inst i_croc_soc/i_croc/i_core_wrap/ictc_preCTS_FE_ECOC5_0240
timeDesign -preCTS
report_timing -path_group reg2reg
saveDesign savestage/fixtiming1
