#######################################################
#                                                     
#  Innovus Command Logging File                     
#  Created on Mon Sep  8 12:27:25 2025                
#                                                     
#######################################################

#@(#)CDS: Innovus v20.10-p004_1 (64bit) 05/07/2020 20:02 (Linux 2.6.32-431.11.2.el6.x86_64)
#@(#)CDS: NanoRoute 20.10-p004_1 NR200413-0234/20_10-UB (database version 18.20.505) {superthreading v1.69}
#@(#)CDS: AAE 20.10-p005 (64bit) 05/07/2020 (Linux 2.6.32-431.11.2.el6.x86_64)
#@(#)CDS: CTE 20.10-p005_1 () Apr 14 2020 09:14:28 ( )
#@(#)CDS: SYNTECH 20.10-b004_1 () Mar 12 2020 22:18:21 ( )
#@(#)CDS: CPE v20.10-p006
#@(#)CDS: IQuantus/TQuantus 19.1.3-s155 (64bit) Sun Nov 3 18:26:52 PST 2019 (Linux 2.6.32-431.11.2.el6.x86_64)

set_global _enable_mmmc_by_default_flow      $CTE::mmmc_default
suppressMessage ENCEXT-2799
win
is_common_ui_mode
restoreDesign /ictc/student_data/vantruong/final_pj/fn_prj_here/flowspd/04ctstimingclean.dat croc_chip
setMultiCpuUsage -localCpu 8
setPreference ConstraintUserXGrid 0.1
setPreference ConstraintUserXOffset 0.1
setPreference ConstraintUserYGrid 0.1
setPreference ConstraintUserYOffset 0.1
setPreference SnapAllCorners 1
setAnalysisMode -analysisType onchipvariation
all_constraint_modes -active
set_interactive_constraint_modes [all_constraint_modes -active]
set_propagated_clock [all_clocks]
current_design
set_max_fanout 32 [current_design]
current_design
set_max_transition 0.5 [current_design] 
setExtractRCMode -layerIndependent 1
setExtractRCMode -defViaCap true
setDesignMode -reset -congEffort
setDesignMode -flowEffort standard -process 130
setDesignMode -topRoutingLayer Metal5
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setPlaceMode -place_opt_post_place_tcl /ictc/student_data/vantruong/final_pj/fn_prj_here/data/scripts/common/place_opt_post_place.tcl
set_table_style -no_frame_fix_width
set_global timing_report_enable_auto_column_width true
set_global report_timing_format {hpin cell fanout load slew delay arrival pin_location}
reset_path_group -all
group_path -name reg2reg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2icg -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name reg2mem -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [filter_collection [all_registers -macros] "is_memory_cell == true"]
group_path -name mem2reg -from [filter_collection [all_registers -macros] "is_memory_cell == true"] -to  [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name reg2out -from [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"] -to [all_outputs]
group_path -name in2reg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell != true"]
group_path -name in2icg  -from [all_inputs -no_clocks] -to [filter_collection [all_registers] "is_integrated_clock_gating_cell == true"]
group_path -name in2out  -from [all_inputs -no_clocks] -to [all_outputs]
setPathGroupOptions reg2reg -effortLevel high
setPathGroupOptions reg2icg -effortLevel high
setPathGroupOptions reg2mem -effortLevel high
setPathGroupOptions mem2reg -effortLevel high
setPathGroupOptions reg2out -effortLevel low
setPathGroupOptions in2reg -effortLevel low
setPathGroupOptions in2icg -effortLevel low
setPathGroupOptions in2out -effortLevel low
reportPathGroupOptions
setNanoRouteMode -reset
setNanoRouteMode -dbProcessNode 130
setNanoRouteMode -quiet -routeInsertAntennaDiode 1
setNanoRouteMode -quiet -routeAntennaCellName sky130_fd_sc_hd__diode_2
setNanoRouteMode -quiet -timingEngine {}
setNanoRouteMode -quiet -routeWithTimingDriven 1
setNanoRouteMode -quiet -routeWithSiDriven 1
setNanoRouteMode -quiet -routeWithSiPostRouteFix 0
setNanoRouteMode -quiet -drouteStartIteration default
setNanoRouteMode -quiet -routeBottomRoutingLayer default
setNanoRouteMode -quiet -drouteEndIteration default
setNanoRouteMode -quiet -routeWithTimingDriven true
setNanoRouteMode -quiet -routeWithSiDriven true
setNanoRouteMode -routeExpAdvancedPinAccess 2
setNanoRouteMode -drouteUseMultiCutViaEffort default
routeDesign -globalDetail
saveDesign SAVED/05_route.invs
timeDesign -postRoute -pathReports -slackReports -numPaths 1000 -prefix croc_postRoute -outDir ./rpt/05_route/05_route_setup
timeDesign -postRoute -hold -pathReports -slackReports -numPaths 1000 -prefix croc_postRoute -outDir ./rpt/05_route/05_route_hold
checkPlace > rpt/05_route/checkPlace.rpt
selectInst pad_status_o
timeDesign -postRoute -slackReports
gpsPrivate::masterAndSlaveCPU
gpsPrivate::masterAndSlaveCPU
gpsPrivate::masterAndSlaveCPU
optDesign -postroute
optDesign -postroute -setup
verify_drc -limit 0
optDesign -postroute -setup
report_timing -path_group reg2reg -path_type full_clock
ecoChangeCell -Inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_postCTS_holdFE_RC_20409_0 -Cell sg13g2_inv_16
set_dont_use sg13g2_buf_16 false
set_dont_use sg13g2_inv_16 false
optDesign -postroute -setup
setLayerPreference node_layer -isVisible 0
setLayerPreference allM5 -isVisible 1
setLayerPreference allM2Cont -isVisible 0
setLayerPreference allM3Cont -isVisible 0
setLayerPreference allM4Cont -isVisible 0
setLayerPreference allM5Cont -isVisible 0
setLayerPreference allM6Cont -isVisible 0
setLayerPreference allM7Cont -isVisible 0
setLayerPreference allM8Cont -isVisible 0
zoomBox -2.91100 -4.42300 1793.60300 1772.24000
zoomBox 418.56200 271.65100 1215.68600 1059.96700
zoomBox 548.28200 356.62000 1037.81600 840.74500
zoomBox 632.81700 410.19400 933.45200 707.50700
zoomBox 670.15100 433.85400 887.36100 648.66400
zoomBox 609.07200 395.14600 962.76400 744.93000
zoomBox 548.27800 356.61800 1037.81800 840.74900
zoomBox 509.61700 332.11700 1085.54700 901.68300
zoomBox 347.67200 229.48500 1285.47900 1156.92900
zoomBox 186.47800 127.32900 1484.48200 1410.99000
setDesignMode -topRoutingLayer Metal5
optDesign -postroute
zoomBox 454.89700 390.21300 1252.03500 1178.54300
routeDesign -globalDetail
verify_drc -limit 0
verify_connectivity -type regular
timeDesign -postroute -slackReports
optDesign -postroute -setup
win
zoomBox 659.79600 441.43700 1075.90800 852.95100
zoomBox 767.03700 469.51600 984.25100 684.33000
zoomBox 812.72600 483.71600 946.12400 615.64000
zoomBox 832.76800 495.03200 929.14900 590.34800
zoomBox 841.50100 506.42700 923.42500 587.44600
zoomBox 855.23300 524.34600 914.42300 582.88200
zoomBox 860.62900 527.40400 910.94000 577.15900
zoomBox 865.21500 530.00300 907.98000 572.29500
uiSetTool ruler
report_timing -path_group reg2reg -path_type full_clock
report_timing -path_group reg2reg -path_type full_clock -gui
win
fit
zoomBox 269.19300 186.21600 1747.88900 1648.57300
zoomBox 414.61200 294.87200 1671.50300 1537.87500
zoomBox 567.03600 391.74200 1635.39400 1448.29500
zoomBox 696.89200 473.78700 1604.99600 1371.85700
zoomBox 901.08900 602.80300 1557.19500 1251.65900
zoomBox 807.26800 543.52400 1579.15800 1306.88500
zoomBox 696.89000 473.78500 1604.99600 1371.85700
zoomBox 919.18600 561.03300 1575.29400 1209.89100
zoomBox 1006.00300 595.10700 1563.69400 1146.63600
zoomBox 1079.79700 623.76200 1553.83400 1092.56100
zoomBox 1195.83800 668.82200 1538.32900 1007.52900
zoomBox 1303.90100 722.36600 1514.23400 930.37500
zoomBox 1329.69900 735.14900 1508.48200 911.95600
zoomBox 1366.70300 755.70600 1495.87300 883.44900
zoomBox 1393.43700 770.55800 1486.76300 862.85300
zoomBox 1384.76300 766.49400 1494.55800 875.07600
zoomBox 1362.55200 756.08800 1514.51700 906.37400
zoomBox 1348.47700 749.47000 1527.25900 926.27700
zoomBox 1312.43500 732.52400 1559.88600 977.24100
zoomBox 1231.11500 694.15400 1634.04800 1092.63500
zoomBox 1152.60700 655.96300 1710.30000 1207.49400
zoomBox 1102.76400 631.67600 1758.87400 1280.53600
zoomBox 823.58300 496.53400 1891.95000 1553.09600
setLayerPreference node_layer -isVisible 1
setLayerPreference node_layer -isVisible 0
setLayerPreference Metal5 -isVisible 1
zoomBox 1018.70200 627.87900 1674.81300 1276.74000
zoomBox 1160.20300 729.52800 1502.69900 1068.24000
zoomBox 1183.19300 746.27400 1474.31600 1034.18000
zoomBox 1233.46400 782.89100 1412.25200 959.70300
zoomBox 1255.66600 799.06200 1384.84100 926.81000
zoomBox 1271.70800 810.74700 1365.03700 903.04500
setLayerPreference Metal3 -isVisible 1
setLayerPreference Via3 -isVisible 1
setLayerPreference Metal4 -isVisible 1
setLayerPreference Metal5 -isVisible 0
setLayerPreference node_layer -isVisible 1
setLayerPreference Via4 -isVisible 0
setLayerPreference node_layer -isVisible 1
setLayerPreference node_layer -isVisible 0
setLayerPreference Metal5 -isVisible 1
zoomBox 1230.05000 780.84300 1408.84000 957.65700
zoomBox 1215.11700 769.80200 1425.45800 977.81900
zoomBox 1124.68700 702.40700 1527.63600 1100.90400
zoomBox 1016.09400 614.28000 1672.23100 1263.16700
zoomBox 936.26700 527.02700 1844.41600 1425.14100
zoomBox 826.77000 406.26200 2083.72300 1649.32600
zoomBox 644.98800 320.88600 2123.75600 1783.31400
zoomBox 431.12600 231.01600 2170.85400 1951.52000
zoomBox -464.71600 -145.44000 2368.14100 2656.11500
zoomBox -212.81100 123.83800 1833.92800 2147.96100
zoomBox 189.21100 560.51400 961.13900 1323.91200
zoomBox 232.92500 602.52200 889.06400 1251.41100
zoomBox 351.32900 716.30700 693.83900 1055.03200
zoomBox 372.80700 735.04100 663.94000 1022.95700
zoomBox 406.58000 764.49900 616.92400 972.51900
zoomBox 422.15200 775.48100 600.94500 952.29800
zoomBox 464.33200 805.22500 557.66400 897.52600
zoomBox 471.21500 810.09800 550.54800 888.55400
zoomBox 486.26800 820.75300 534.98800 868.93500
zoomBox 490.61500 823.27000 532.02700 864.22400
zoomBox 494.31000 825.40900 529.51000 860.22000
setLayerPreference poly -isVisible 1
setLayerPreference node_layer -isVisible 1
zoomBox 500.89300 830.21100 526.32600 855.36300
zoomBox 493.75000 827.44200 568.85800 857.47400
setLayerPreference node_layer -isVisible 0
setLayerPreference node_layer -isVisible 1
setLayerPreference node_layer -isVisible 0
setLayerPreference Metal5 -isVisible 1
zoomBox 448.59100 815.23000 592.47600 872.76300
zoomBox 432.12200 810.72200 601.39900 878.40800
zoomBox 331.58900 783.20000 655.87400 912.86600
zoomBox 139.00100 730.47800 760.22900 978.87800
zoomBox -15.75200 688.11300 844.08300 1031.92100
zoomBox -114.16400 661.17200 897.40700 1065.65200
zoomBox -303.15500 565.67900 1096.94400 1125.51300
zoomBox -442.91700 508.21500 1204.25800 1166.84300
zoomBox -801.25000 361.07500 1478.57900 1272.67200
zoomBox -1050.96800 275.17900 1631.18400 1347.64600
zoomBox -1515.79200 28.02900 2196.53000 1512.41300
zoomBox -1084.36700 186.54500 2071.10600 1448.27100
zoomBox -405.31000 449.94400 1874.52000 1361.54100
zoomBox 48.64000 657.42400 1695.81700 1316.05300
zoomBox 327.32000 787.54200 1517.40700 1263.40200
zoomBox 528.66800 881.55300 1388.50600 1225.36200
zoomBox 665.73900 949.47600 1286.97200 1197.87800
zoomBox 715.64700 976.00200 1243.69500 1187.14400
zoomBox 824.62600 1034.00500 1148.91600 1163.67300
zoomBox 866.55700 1056.06200 1100.85600 1149.74700
zoomBox 882.90400 1064.64800 1082.06000 1144.28100
zoomBox 799.41300 1020.62900 1180.93500 1173.18200
zoomBox 333.06900 774.75400 1733.21800 1334.60800
zoomBox 219.95000 715.11300 1867.18400 1373.76500
zoomBox -725.53900 216.61100 2986.91800 1701.04900
zoomBox -539.64400 379.62600 2615.94500 1641.39900
zoomBox -243.47000 633.39800 2036.44400 1545.02900
zoomBox -29.48500 816.74800 1617.75400 1475.40200
zoomBox 296.58000 1077.60100 1027.47100 1369.85000
zoomBox 335.59100 1108.81000 956.84900 1357.22200
zoomBox 447.44900 1192.39100 771.75000 1322.06400
zoomBox 510.45400 1233.33400 679.74200 1301.02400
zoomBox 529.54800 1245.74100 651.85900 1294.64700
zoomBox 543.34400 1254.70500 631.71300 1290.04000
zoomBox 548.22500 1258.05000 623.34000 1288.08500
zoomBox 558.87700 1265.36500 605.00900 1283.81100
zoomBox 558.87400 1265.36400 605.01100 1283.81200
zoomBox 552.35900 1260.89200 616.21800 1286.42600
zoomBox 538.79400 1259.60300 627.18000 1294.94400
zoomBox 519.76400 1257.95900 642.09900 1306.87500
zoomBox 456.97300 1252.53500 691.33000 1346.24300
zoomBox 240.02900 1233.79300 861.42000 1482.25800
zoomBox -335.19100 1184.10100 1312.41100 1842.90000
zoomBox -689.90300 1153.45800 1590.51600 2065.29100
zoomBox -1860.37100 1052.34400 2508.19700 2799.13000
zoomBox -2405.71700 748.27900 3640.74300 3165.97600
zoomBox -2752.52000 554.91500 4360.96400 3399.26500
zoomBox -3587.86600 530.04800 4780.93900 3876.34200
fit
zoomBox -916.18500 99.68700 2741.04700 1562.04300
zoomBox -634.85000 206.34500 2473.79800 1449.34800
zoomBox -151.34600 441.86400 1757.75400 1205.22400
zoomBox 58.15300 549.52900 1437.47900 1101.05700
zoomBox 268.62900 657.69600 1115.71200 996.40500
zoomBox 397.88900 724.12400 918.10600 932.13400
zoomBox 434.30000 739.06600 876.48500 915.87500
zoomBox 491.55600 762.56300 811.03600 890.30800
zoomBox 513.91700 771.74000 785.47500 880.32300
zoomBox 549.07800 786.17000 745.28000 864.62200
zoomBox 574.48300 796.59600 716.24000 853.27800
zoomBox 513.91400 771.73900 785.47600 880.32400
zoomBox 465.24400 751.76500 841.10900 902.05600
zoomBox 434.52800 726.98000 954.75700 934.99500
zoomBox 370.52100 671.58000 1217.62900 1010.29900
zoomBox 341.34700 646.24500 1337.94500 1044.73800
zoomBox 464.62400 658.20000 1311.73200 996.91900
zoomBox 562.69700 669.66700 1282.73900 957.57800
zoomBox 777.14600 694.74000 1219.34300 871.55400
zoomBox 828.29200 700.72600 1204.16000 851.01800
zoomBox 908.71900 710.13800 1180.28400 818.72400
zoomBox 828.44300 700.72500 1204.31400 851.01800
zoomBox 563.80400 669.66400 1283.85700 957.58000
zoomBox 60.22400 609.19500 1439.62300 1160.75200
zoomBox -282.01600 536.50700 1627.18900 1299.90900
zoomBox -16.08700 771.08800 1156.40600 1239.91300
zoomBox 102.07600 875.40600 949.20200 1214.13200
zoomBox 148.22300 916.14500 868.28100 1204.06300
zoomBox 293.69500 1044.57300 613.19000 1172.32400
zoomBox 338.46600 1084.09900 534.67800 1162.55500
zoomBox 358.23800 1101.55600 500.00300 1158.24100
zoomBox 293.39000 1044.60300 612.90000 1172.36000
zoomBox 272.62300 1026.60700 648.51800 1176.91000
zoomBox 74.89400 882.87500 922.07000 1221.62100
zoomBox -295.82900 658.02000 1327.09600 1306.95200
zoomBox -924.28300 376.71200 1718.38400 1433.39100
zoomBox -674.75200 513.40200 1571.51500 1411.57900
zoomBox 20.04000 896.39900 1192.60800 1365.25400
zoomBox 314.82200 1059.06000 1034.92600 1346.99600
zoomBox 445.01200 1130.89800 965.28700 1338.93200
zoomBox 575.95400 1203.07200 895.46900 1330.83100
zoomBox 675.56800 1257.19300 842.35700 1323.88400
zoomBox 609.37500 1222.34000 880.96500 1330.93600
zoomBox 579.27500 1206.55200 898.79300 1334.31200
zoomBox 395.70100 1110.34300 1007.79800 1355.09200
zoomBox 514.40300 1189.01600 890.30800 1339.32300
zoomBox 542.74000 1207.79700 862.26000 1335.55800
zoomBox 618.93700 1258.66900 785.72800 1325.36100
zoomBox 664.81700 1289.77900 738.82500 1319.37100
zoomBox 673.44400 1296.98000 726.91600 1318.36100
zoomBox 676.77400 1299.79900 722.22600 1317.97300
zoomBox 678.46000 1301.84500 717.09400 1317.29300
zoomBox 682.14500 1306.31800 705.87200 1315.80500
zoomBox 681.11000 1305.06100 709.02400 1316.22300
zoomBox 676.77200 1299.79700 722.22700 1317.97200
zoomBox 666.47800 1287.30500 753.56100 1322.12500
zoomBox 639.48200 1254.54200 835.74600 1333.01900
zoomBox 595.04600 1200.61300 971.02800 1350.95100
zoomBox 536.63400 1129.72200 1148.86000 1374.52300
zoomBox 418.25300 1018.24000 1415.16400 1416.85800
zoomBox 299.98500 907.83800 1679.79200 1459.55800
zoomBox 223.70300 838.16500 1847.00500 1487.24800
zoomBox 28.37600 659.76600 2275.16300 1558.15100
zoomBox -97.87400 546.89800 2545.40600 1603.82200
zoomBox -421.14100 257.89300 3237.37800 1720.76400
zoomBox -626.71800 74.10600 3677.42400 1795.13100
zoomBox -284.96000 298.43800 2824.78300 1541.87900
zoomBox 109.10200 394.87900 2355.89200 1293.26500
zoomBox 516.46200 546.16100 1689.30200 1015.12500
saveDesign fixdrcclean
setNanoRouteMode -drouteAntennaFactor 1
setNanoRouteMode -droutePostRouteSpreadWire auto
setNanoRouteMode -drouteStartIteration 0
setNanoRouteMode -extractThirdPartyCompatible false
setNanoRouteMode -routeAntennaCellName sky130_fd_sc_hd__diode_2
setNanoRouteMode -routeExpAdvancedPinAccess 2
setNanoRouteMode -routeInsertAntennaDiode true
setNanoRouteMode -routeWithSiDriven true
setNanoRouteMode -routeWithSiPostRouteFix false
setNanoRouteMode -routeWithTimingDriven true
setNanoRouteMode -timingEngine {}
setDesignMode -bottomRoutingLayer Metal2
setDesignMode -congEffort high
setDesignMode -flowEffort standard
setDesignMode -process 130
setDesignMode -topRoutingLayer Metal5
setExtractRCMode -basic true
setExtractRCMode -coupled true
setExtractRCMode -coupling_c_th 0.4
setExtractRCMode -defViaCap true
setExtractRCMode -engine postRoute
setExtractRCMode -extended false
setExtractRCMode -layerIndependent 1
setExtractRCMode -minNetTermNrToBeInMem 50
setExtractRCMode -relative_c_th 1
setExtractRCMode -total_c_th 0
setUsefulSkewMode -ecoRoute false
setDelayCalMode -enable_high_fanout true
setDelayCalMode -eng_copyNetPropToNewNet true
setDelayCalMode -engine aae
setDelayCalMode -ignoreNetLoad false
setDelayCalMode -SIAware true
optDesign -postRoute -setup
win
zoomBox 444.02900 497.87300 1823.84100 1049.59500
zoomBox 106.43700 179.99300 2749.72500 1236.92000
zoomBox 193.70600 284.71600 2440.50100 1183.10400
zoomBox 430.08500 568.37100 1602.92800 1037.33600
zoomBox 553.47500 716.44100 1165.71000 961.24500
zoomBox 628.68900 806.39600 900.34000 915.01700
zoomBox 638.61300 817.00900 869.51800 909.33700
zoomBox 647.05000 826.03000 843.31900 904.50900
zoomBox 654.22100 833.69800 821.05000 900.40500
fit
zoomBox -987.29600 184.19400 2669.93700 1646.55100
zoomBox -743.79500 292.06000 2364.85400 1535.06300
setLayerPreference Metal5 -isVisible 0
setLayerPreference Metal5 -isVisible 1
setLayerPreference Metal5 -isVisible 0
setLayerPreference Metal5 -isVisible 1
zoomBox -47.24500 658.73300 1332.07900 1210.26000
zoomBox 36.09100 702.60200 1208.51700 1171.40000
zoomBox 167.13700 771.58600 1014.21500 1110.29300
zoomBox 362.90100 844.36500 805.08300 1021.17300
zoomBox 394.97000 856.28700 770.82500 1006.57400
zoomBox 271.42900 816.78100 883.44900 1061.49900
zoomBox 214.93100 798.71400 934.95500 1086.61800
zoomBox 148.46200 777.45900 995.55000 1116.17000
zoomBox 63.79200 751.02700 1060.36800 1149.51100
zoomBox -290.87700 640.30800 1331.88200 1289.17300
zoomBox -351.59600 570.55400 1557.53200 1333.92500
zoomBox -10.32700 682.88500 1369.01800 1234.42100
zoomBox 67.08900 732.67500 1239.53400 1201.48100
zoomBox 150.44200 758.86800 1147.02000 1157.35300
zoomBox 281.51300 800.05600 1001.54200 1087.96200
uiSetTool select
zoomBox 205.44200 791.57300 1052.53500 1130.28600
zoomBox 115.94700 781.59200 1112.52700 1180.07800
zoomBox -10.63200 762.75400 1161.81600 1231.56100
zoomBox -85.77300 728.90200 1293.57800 1280.44000
zoomBox -256.79900 639.11400 1652.34000 1402.48900
zoomBox -339.35700 579.79000 1906.68900 1477.87900
zoomBox -181.90400 641.33800 1727.23600 1404.71400
zoomBox 66.58500 737.76500 1445.93900 1289.30400
zoomBox 428.29000 876.81700 1040.32000 1121.53900
zoomBox 471.59900 893.45300 991.82500 1101.46700
zoomBox 508.41200 907.53700 950.60400 1084.34900
zoomBox 588.90600 938.33200 860.47100 1046.91800
zoomBox 565.52500 929.96400 885.01300 1057.71200
zoomBox 505.65500 908.53600 947.85400 1085.35100
zoomBox 467.58100 894.90900 987.81600 1102.92700
zoomBox 235.15800 811.72600 1231.77100 1210.22500
zoomBox 149.35100 781.01600 1321.83600 1249.83800
zoomBox 48.40100 744.88700 1427.79500 1296.44200
zoomBox -222.91500 652.76400 1686.28300 1416.16300
zoomBox -76.25800 702.56000 1546.56000 1351.44900
zoomBox 154.35900 780.86400 1326.84500 1249.68600
zoomBox 386.05300 859.53300 1106.10600 1147.44900
zoomBox 288.25700 852.35500 1135.37900 1191.07900
zoomBox 173.20400 843.91000 1169.81800 1242.40900
zoomBox 37.84800 833.97400 1210.33500 1302.79700
zoomBox -121.39700 822.28500 1258.00200 1373.84200
zoomBox -529.14900 792.35500 1380.05500 1555.75600
zoomBox -1093.51000 750.92800 1548.98700 1807.53900
zoomBox -1257.39000 709.87200 1851.43000 1952.94400
zoomBox -1463.47400 665.59600 2193.96300 2128.03400
zoomBox -2039.60100 374.95600 3022.59600 2399.09200
zoomBox -2405.97700 197.33800 3549.54900 2578.67500
zoomBox -3289.49500 -41.60500 4953.45000 3254.36300
zoomBox -2664.47100 -10.76200 4342.03300 2790.81100
zoomBox -1109.33800 499.02000 3193.53300 2219.53700
zoomBox -737.13900 615.03600 2920.30300 2077.47600
zoomBox -436.46700 681.45000 2672.35900 1924.52400
zoomBox -180.89600 738.24400 2461.60700 1794.85700
zoomBox 231.75000 757.07300 2140.95900 1520.47600
zoomBox 392.27500 764.42600 2015.10300 1413.31900
zoomBox 644.70000 775.98900 1817.19400 1244.81500
zoomBox 743.28100 780.50500 1739.90200 1179.00700
zoomBox 958.84300 790.38000 1570.89500 1035.11100
zoomBox 1041.21100 799.72600 1483.41800 976.54400
zoomBox 1073.37900 803.37600 1449.25500 953.67100
zoomBox 1012.36900 792.67700 1532.61500 1000.69900
zoomBox 874.22600 768.45300 1721.36100 1107.18300
zoomBox 811.04900 757.37500 1807.68000 1155.88100
zoomBox 736.72300 744.34200 1909.23100 1213.17300
zoomBox 874.14800 788.82200 1594.21500 1076.74300
zoomBox 906.24200 799.59900 1518.29900 1044.33200
zoomBox 956.70900 816.54600 1398.92100 993.36600
zoomBox 1027.28000 839.96200 1258.12000 932.26400
zoomBox 1041.91300 843.97600 1238.12700 922.43300
zoomBox 1064.96300 850.28800 1206.72800 906.97300
zoomBox 1081.61700 854.84800 1184.04200 895.80300
zoomBox 1088.12000 856.62900 1175.18200 891.44100
zoomBox 1094.15500 858.08500 1168.16000 887.67600
zoomBox 1099.28600 859.32300 1162.19000 884.47500
zoomBox 1110.50500 862.02800 1149.13700 877.47500
zoomBox 1113.18300 862.67400 1146.02100 875.80400
zoomBox 1110.50500 862.02800 1149.13700 877.47500
zoomBox 1103.64600 860.37400 1157.11600 881.75400
zoomBox 1081.01400 854.91400 1183.44700 895.87200
zoomBox 1037.65800 844.45300 1233.89000 922.91700
zoomBox 954.60300 824.41500 1330.52400 974.72800
zoomBox 736.75500 771.85400 1583.98800 1110.62300
zoomBox 490.69500 712.48600 1870.27500 1264.11600
zoomBox 90.02700 615.81700 2336.44600 1514.05500
zoomBox 182.48700 651.91100 2091.94500 1415.41400
zoomBox 327.88000 708.66900 1707.46600 1260.30100
zoomBox 384.66300 730.83600 1557.31100 1199.72300
zoomBox 432.92800 749.67700 1429.67900 1148.23100
zoomBox 508.82500 779.30400 1228.97800 1067.26000
zoomBox 456.88800 772.03100 1304.12900 1110.80300
zoomBox 324.53100 753.04000 1497.18500 1221.93000
zoomBox 210.35700 729.81100 1589.95100 1281.44600
zoomBox -267.90400 632.50500 1978.53800 1530.75200
zoomBox -486.62400 588.00500 2156.24800 1644.76600
report_timing -path_group reg2reg -path_type full_clock
selectInst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/_5005_
win
zoomSelected
zoomBox 1311.41800 1015.37400 1350.67000 1031.06900
zoomBox 1307.80500 1014.30200 1353.98300 1032.76600
zoomBox 1298.55300 1011.55600 1362.46700 1037.11200
zoomBox 1285.74700 1007.75600 1374.20900 1043.12800
zoomBox 1268.02100 1002.49600 1390.46400 1051.45500
zoomBox 1187.93800 978.73000 1463.89900 1089.07400
zoomBox 1097.48600 951.88700 1546.84600 1131.56500
zoomBox 1007.45500 925.16900 1629.40600 1173.85800
zoomBox 1056.12000 939.61100 1584.77900 1150.99700
zoomBox 1162.53300 971.19000 1487.19700 1101.00800
zoomBox 1243.48400 995.21300 1412.96200 1062.97900
zoomBox 1256.74400 999.14800 1400.80200 1056.75000
zoomBox 1298.54600 1011.55300 1362.46700 1037.11200
zoomBox 1317.09500 1017.05700 1345.45800 1028.39800
zoomBox 1321.20000 1018.27600 1341.69300 1026.47000
deselectAll
selectInst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/_5005_
ecoAddRepeater -term i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/_5005_/Y -cell sg13g2_buf_4
report_timing -path_group reg2reg -path_type full_clock -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/_5005_
report_timing -path_group reg2reg -path_type full_clock
timeDesign -postRoute -slackReports
report_timing -path_group reg2reg -path_type full_clock
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_postCTS_holdFE_USKC561_CTS_7 -cell sg13g2_buf_16
report_timing -path_group reg2reg -path_type full_clock -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_postCTS_holdFE_USKC561_CTS_7
report_timing -path_group reg2reg -path_type full_clock -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_postCTS_holdFE_USKC561_CTS_7
report_timing -path_group reg2reg -path_type full_clock
ecoChangeCell -inst i_croc_soc/i_croc/i_core_wrap/ictc_postCTS_holdFE_USKC297_CTS_23 -cell sg13g2_buf_16
report_timing -path_group reg2reg -path_type full_clock -through i_croc_soc/i_croc/i_core_wrap/ictc_postCTS_holdFE_USKC297_CTS_23
report_timing -path_group reg2reg -path_type full_clock
timeDesign -postRoute -slackReports
report_timing -path_group reg2reg -path_type full_clock
ecoChangeCell -Inst i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_postCTS_holdFE_USKC307_CTS_14 -cell sg13g2_buf_16
report_timing -path_group reg2reg -path_type full_clock -through i_croc_soc/i_croc/i_core_wrap/i_ibex_register_file_i/ictc_postCTS_holdFE_USKC307_CTS_14
report_timing -path_group reg2reg -path_type full_clock
report_timing -path_group reg2reg -path_type full_clock -gui
win
fit
zoomBox -521.67000 316.42200 2586.97900 1559.42500
zoomBox 374.43400 648.99000 1997.16800 1297.84500
zoomBox 636.78300 789.04400 1809.20800 1257.84200
zoomBox 504.26500 780.08800 1883.58800 1331.61500
zoomBox 194.09600 766.87200 2103.19400 1530.23100
zoomBox -235.20500 748.58100 2407.14700 1805.13400
zoomBox -821.20100 720.28600 2836.03300 2182.64300
zoomBox -1606.50400 673.91000 3455.41100 2697.93300
zoomBox -2105.90200 644.41800 3849.29300 3025.62200
zoomBox -3090.96500 31.90000 5151.52100 3327.68500
zoomBox -2448.74000 143.47300 4557.37300 2944.89000
zoomBox -421.37400 495.18700 2687.27800 1738.19200
zoomBox 363.55300 629.27900 1986.29100 1278.13600
zoomBox 840.41200 710.74200 1560.42900 998.64300
zoomBox 987.58600 735.81300 1429.76700 912.62100
zoomBox 1020.04300 744.32900 1395.89800 894.61600
zoomBox 1090.18200 763.08600 1321.00400 855.38100
zoomBox 1071.53300 757.25800 1343.09000 865.84100
zoomBox 1023.78200 742.33600 1399.64100 892.62400
zoomBox 993.41600 732.84600 1435.60300 909.65600
zoomBox 866.21500 693.09600 1586.24500 981.00200
setLayerPreference node_layer -isVisible 1
setLayerPreference node_layer -isVisible 0
zoomBox 798.81400 671.00200 1645.90800 1009.71500
zoomBox 626.23100 614.42900 1798.67900 1083.23600
zoomBox 225.72800 420.93400 2134.86400 1184.30800
zoomBox 42.56800 332.44400 2288.61000 1230.53100
zoomBox 238.82900 456.03400 2147.96500 1219.40800
zoomBox 440.94800 565.91800 2063.71400 1214.78600
zoomBox 612.74900 659.31900 1992.10000 1210.85700
zoomBox 755.74300 733.24500 1928.19300 1202.05300
zoomBox 877.28900 795.95300 1873.87200 1194.44000
zoomBox 787.22500 732.59900 1959.67800 1201.40800
zoomBox 920.99200 772.76200 1641.02600 1060.67000
zoomBox 1028.05500 798.51800 1403.91900 948.80800
fit
zoomBox -1610.79600 -92.00100 3451.11600 1932.02100
zoomBox -650.42900 3.85800 1991.92300 1060.41100
zoomBox -380.86300 102.14700 1865.13700 1000.21700
zoomBox -140.85600 208.43200 1768.24400 971.79200
zoomBox 510.57200 507.03100 1507.13500 905.51000
zoomBox 612.12900 552.43600 1459.20800 891.14300
zoomBox 779.66200 629.52000 1391.67900 874.23700
zoomBox 980.12600 725.45800 1299.60400 853.20200
zoomBox 1060.95800 764.43900 1257.16000 842.89100
zoomBox 1116.82900 792.29200 1219.24900 833.24500
zoomBox 1124.46000 794.64800 1211.51700 829.45800
zoomBox 1141.14300 799.79800 1194.60900 821.17700
selectInst i_croc_soc/i_croc/i_core_wrap/ictc_postCTS_holdFE_PSBC227_FE_RN_2623_0
deselectAll
zoomBox 1130.64100 798.53200 1204.64300 828.12200
zoomBox 1120.61000 797.30500 1207.67100 832.11700
zoomBox 1094.92200 794.16400 1215.42400 842.34700
zoomBox 1036.75900 787.05300 1232.97800 865.51200
zoomBox 1010.15900 783.80100 1241.00600 876.10600
zoomBox 847.77900 763.79400 1290.01400 940.62300
zoomBox 717.30300 747.71800 1329.39300 992.46400
zoomBox 634.33000 737.49400 1354.43600 1025.43100
zoomBox 287.75600 694.66900 1460.33400 1163.52800
zoomBox 187.63700 598.18600 1810.58300 1247.12600
zoomBox 123.96900 536.82900 2033.31700 1300.28800
zoomBox 597.16100 690.34400 1769.74000 1159.20400
zoomBox 694.58800 722.08900 1691.28100 1120.62000
setLayerPreference node_layer -isVisible 1
zoomBox 826.76100 734.70300 1673.95000 1073.45400
zoomBox 1428.23700 792.10800 1595.03100 858.80100
zoomBox 1484.17900 797.58500 1586.61400 838.54400
zoomBox 1495.08000 800.13300 1582.15000 834.94800
zoomBox 1512.22200 804.13900 1575.13000 829.29300
zoomBox 1525.14300 807.01500 1570.59500 825.18900
zoomBox 1530.43000 808.05000 1569.06400 823.49800
zoomBox 1541.98900 810.31300 1565.71800 819.80100
zoomBox 1549.07600 811.68300 1563.64900 817.51000
zoomBox 1553.12200 812.52900 1562.07300 816.10800
zoomBox 1554.08300 812.73100 1561.69200 815.77300
zoomBox 1554.75600 812.94600 1561.22400 815.53200
zoomBox 1555.32300 813.13000 1560.82100 815.32800
zoomBox 1556.56300 813.52900 1559.94100 814.88000
zoomBox 1557.10400 813.70600 1559.54500 814.68200
zoomBox 1555.34800 813.12600 1560.85600 815.32800
zoomBox 1552.46000 812.17000 1563.01400 816.39000
zoomBox 1551.39400 811.81700 1563.81100 816.78200
zoomBox 1542.48300 808.86900 1570.47100 820.06000
zoomBox 1522.40100 802.22500 1585.48000 827.44700
zoomBox 1499.71900 794.72200 1602.43300 835.79300
zoomBox 1462.91200 782.55300 1630.16700 849.43000
zoomBox 1446.08600 776.98700 1642.85700 855.66700
zoomBox 1305.81000 730.46900 1749.28500 907.79400
zoomBox 1147.36900 677.92700 1869.49600 966.67200
zoomBox 1075.09600 653.89900 1924.65800 993.59900
zoomBox 633.90600 507.21600 2261.40100 1157.97500
zoomBox 471.02300 453.06200 2385.72300 1218.66100
zoomBox -6077.18500 -1724.02800 7383.70800 3658.35400
ecoRoute
timeDesign -postRoute -slackReports
win
zoomBox -2660.93100 -932.44500 4365.74400 1877.19400
zoomBox -2077.86700 -751.49400 3894.80700 1636.69900
zoomBox -1154.36000 -434.21600 3160.89700 1291.25400
zoomBox -210.74600 -75.78200 2439.36400 983.87300
zoomBox 382.71300 285.09400 2010.21300 935.85500
fit
zoomBox -557.49500 521.90600 2551.15200 1764.90900
zoomBox 24.77500 692.79000 2270.77600 1590.86100
fit
zoomBox -1106.64800 26.65500 3195.97800 1747.07400
zoomBox -4.26400 286.11100 2638.08800 1342.66400
setLayerPreference violation -isVisible 1
violationBrowser -all -no_display_false -displayByLayer
violationBrowserClose
redirect -quiet {set honorDomain [getAnalysisMode -honorClockDomains]} > /dev/null
timeDesign -preCTS -pathReports -drvReports -slackReports -numPaths 50 -prefix croc_chip_preCTS -outDir timingReports
zoomBox -168.82000 234.79400 2939.83000 1477.79800
zoomBox -362.41600 174.42100 3294.82100 1636.77900
zoomBox -72.02400 320.36100 2570.33000 1376.91500
zoomBox 434.87600 465.02900 2057.61200 1113.88500
zoomBox 575.24300 495.92400 1954.56900 1047.45200
zoomBox 800.18200 543.66400 1796.74600 942.14300
setLayerPreference node_layer -isVisible 0
zoomBox 640.11200 485.53200 2019.44000 1037.06100
zoomBox 538.31800 448.56500 2161.05800 1097.42300
zoomBox -83.09100 222.89500 3025.57600 1465.90600
zoomBox -312.51000 139.58000 3344.74700 1601.94600
zoomBox -59.34600 381.57500 2583.02200 1438.13400
zoomBox 58.42500 483.64400 2304.43900 1381.72000
zoomBox 158.53100 570.40300 2067.64400 1333.76800
zoomBox 312.45100 674.18200 1691.78500 1225.71300
zoomBox 423.93700 748.60000 1420.50800 1147.08200
zoomBox 522.76300 796.57600 1242.78600 1084.48000
zoomBox 556.36000 817.41600 1168.38000 1062.13400
zoomBox 629.54500 863.09100 1005.40300 1013.37900
win
zoomBox 545.65300 847.29300 1065.87100 1055.30400
zoomBox 268.50400 791.02400 1265.08200 1189.50900
zoomBox 166.18400 770.25000 1338.62900 1239.05600
fit
zoomBox -825.49500 89.38000 2831.73800 1551.73700
zoomBox -201.86800 330.62800 2440.48400 1387.18100
zoomBox 548.72000 629.93600 1928.04500 1181.46400
zoomBox 675.46800 695.36000 1847.89600 1164.15900
zoomBox 705.91800 729.81000 1702.48200 1128.28900
zoomBox 772.50000 805.13900 1384.51700 1049.85600
zoomBox 795.80300 823.32400 1316.01900 1031.33400
zoomBox 815.61200 838.78200 1257.79500 1015.59000
fit
zoomBox -1166.25500 85.14700 3136.37100 1805.56600
zoomBox -160.57500 541.12600 2481.77700 1597.67900
zoomBox 79.62100 651.33700 2325.62000 1549.40700
zoomBox 283.78700 745.01600 2192.88700 1508.37600
zoomBox 607.94900 882.60900 1987.27400 1434.13700
zoomBox 893.08400 1003.60100 1740.16500 1342.30900
zoomBox 939.97500 1032.77900 1659.99400 1320.68100
zoomBox 1065.36400 1112.78200 1441.21900 1263.06900
zoomBox 1085.83900 1126.01800 1405.31600 1253.76200
zoomBox 1118.03600 1146.83200 1348.85800 1239.12700
fit
zoomBox -654.94400 290.62600 2453.70400 1533.62900
zoomBox -426.75600 381.96900 2215.59500 1438.52200
zoomBox -220.00200 465.42700 2025.99700 1363.49700
zoomBox -44.26100 536.36600 1864.83900 1299.72600
zoomBox 108.48100 596.24400 1731.21600 1245.10000
fit
zoomBox -1031.61200 68.76900 2625.62200 1531.12600
zoomBox -613.15100 184.92500 2029.20300 1241.47900
zoomBox -59.93900 337.82200 1319.38700 889.35000
zoomBox 83.53900 354.95200 1080.10200 753.43100
zoomBox 139.80100 361.64200 986.88000 700.34900
zoomBox 178.95400 374.32000 898.97100 662.22100
zoomBox 240.52200 394.25600 760.73500 602.26500
zoomBox 315.21300 403.37600 586.76900 511.95900
zoomBox 348.49900 407.75800 515.27100 474.44200
zoomBox 356.44500 408.80400 498.20200 465.48600
zoomBox 366.27300 410.64500 486.76700 458.82500
zoomBox 375.07800 412.51500 477.49800 453.46800
zoomBox 393.89600 417.44400 456.79500 442.59400
zoomBox 398.64400 419.11900 452.10900 440.49700
zoomBox 406.10900 421.75200 444.74100 437.19900
zoomBox 411.50400 423.66300 439.41700 434.82400
zoomBox 415.40200 425.04300 435.56900 433.10700
zoomBox 420.25200 426.76100 430.78100 430.97100
zoomBox 421.72100 427.28100 429.33100 430.32400
fit
zoomBox -1279.89700 14.39900 3022.72900 1734.81800
zoomBox -868.41700 69.80000 2788.81500 1532.15600
zoomBox -219.87600 156.91700 2422.47600 1213.47000
zoomBox -12.24900 190.64900 2233.75000 1088.71900
zoomBox 173.81200 295.95800 1796.54600 944.81300
zoomBox 240.42400 338.63900 1619.74800 890.16600
zoomBox 260.92400 381.32300 1257.48600 779.80200
zoomBox 268.92900 397.99300 1116.00800 736.70000
zoomBox 308.82800 411.79000 1028.84500 699.69100
zoomBox 371.56900 433.48500 891.78200 641.49400
zoomBox 392.00900 470.23700 767.86400 620.52400
zoomBox 399.99200 484.59000 719.46900 612.33400
zoomBox 410.18700 495.70000 681.74400 604.28300
zoomBox 430.25400 511.01400 626.45600 589.46600
zoomBox 445.03400 521.51900 586.79000 578.20100
zoomBox 450.80500 525.62200 571.29900 573.80200
zoomBox 459.88100 532.04900 546.93800 566.85900
zoomBox 463.42500 534.55900 537.42500 564.14800
zoomBox 468.99900 538.50600 522.46400 559.88400
zoomBox 473.99400 542.57800 506.82900 555.70700
zoomBox 463.58000 541.47300 517.04700 562.85200
fit
zoomBox -1268.19800 17.18400 3034.42700 1737.60300
zoomBox -976.99100 109.99100 2680.24200 1572.34800
timeDesign -postRoute -slackReports
